###############################################################################################################
###############################################################################################################
###############################################################################################################
###############################################    One Project   ##############################################
###############################################################################################################
###############################################################################################################
############################################################################################################### 

#  یک عدد بین 1 تا 9 انتخاب کنید  # 

#  عدد انتخابی رو در 2 ضرب کنید  #

#  جواب بدست آمده رو با 8 جمع کنید  #

#  جواب رو با عدد اولی که انتخاب کردی جمع کنید  # 

#  جواب رو منهای 2 کنید  # 

#  جواب رو بر 3 تقسیم کنید  #

#  عدد اول که انتخاب کرده بودی رو از جواب کم کنید  #

#  جواب رو در 4 ضرب کنید  #

#  جوای میشه 8  #

#  آیا پایتون إهن شمارو خوند ؟  #

first_number = int(input('choose a number Between  1--9 : ') ) 

number = first_number

number *= 2                       # number = number * 2

number += 8                       # number = number + 8

number += first_number            # number = number + first_number

number -= 2                       # number = number - 2

number /= 3                       # number = number / 3

number -= first_number            # number = number - first_number

number *= 4                       # number = number * 4 

print(number)


